#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \setmainfont{"微软雅黑"}
#+ATTR_LATEX: :width 5cm :options angle=90
#+TITLE: 面试相关问题
#+AUTHOR: 杨 睿
#+EMAIL: yangruipis@163.com
#+KEYWORDS: 
#+OPTIONS: H:4 toc:t 


*** 数轴上从左到右有n个点a[0],a[1]…,a[n-1]，给定一根长度为L的绳子，求绳子最多能覆盖其中的几个点。要求算法复杂度为o(n)


#+BEGIN_SRC python :results output

def cover(a: list, l: int):
    begin = 0
    end = 1
    max_cover = 1
    while end < len(a):
        if a[end] - a[begin] > l:
            # print(max_cover)
            begin += 1
        else:
            max_cover = max(end-begin+1, max_cover)
            end += 1
    return max_cover

a = cover([1,3,4,5,6,8,10], 4)
print(a)
#+END_SRC

#+RESULTS:
: 4

